Repository: maker-community/ElectronBot.DotNet
Catalog: src/ElectronBot.Braincase/Strings/*/Resources.resw
Source language: en_us
Languages: ko_kr, zh_cn

# AppDisplayName
source: ElectronBot Braincase
zh_cn: 电子脑壳

# AppDescription
source: This is a host computer software developed by windows app sdk. It is mainly developed for the open source project ElectronBot robot. It mainly provides action arrangement and action playback and display.
ko_kr: Windows app sdk에서 개발한 호스트 컴퓨터 소프트웨어로 주로 오픈소스 프로젝트인 ElectronBot 로봇을 위해 개발되었으며 주로 동작 배열과 동작 재생 및 표시 기능을 제공합니다.
zh_cn: 这是一个windows app sdk 开发的上位机软件，主要是为开源项目ElectronBot机器人开发的上位机，主要提供动作编排和动作播放和和显示。

# Shell_Main.Content
source: ElectronBot Control
ko_kr: ElectronBot 제어
zh_cn: 电子控制

# Settings_Personalization.Text
source: Personalise
ko_kr: 개인화하다
zh_cn: 个性化

# Settings_Theme.Text
source: Theme
ko_kr: 주제
zh_cn: 主题

# Settings_Theme_Light.Content
source: Light
ko_kr: 밝은 색
zh_cn: 浅色

# Settings_Theme_Dark.Content
source: Dark
ko_kr: 어두운
zh_cn: 深色

# Settings_Theme_Default.Content
source: Default
ko_kr: 기본
zh_cn: 默认

# Settings_About.Text
source: About this software
ko_kr: 이 소프트웨어 정보
zh_cn: 关于此软件

# Settings_AboutDescription.Text
source: This is a host computer software developed by windows app sdk. It is mainly developed for the open source project ElectronBot robot. It mainly provides action arrangement and action playback and display.
ko_kr: Windows app sdk에서 개발한 호스트 컴퓨터 소프트웨어로 주로 오픈소스 프로젝트인 ElectronBot 로봇을 위해 개발되었으며 주로 동작 배열과 동작 재생 및 표시 기능을 제공합니다.
zh_cn: 这是一个windows app sdk 开发的上位机软件，主要是为开源项目ElectronBot机器人开发的上位机，主要提供动作编排和动作播放和和显示。

# SettingsPage_PrivacyTermsLink.Content
source: Privacy policy
ko_kr: 개인 정보 정책
zh_cn: 隐私策略

# ElectronBotAddTip
source: ElectronBot connected
ko_kr: ElectronBot이 연결되었습니다.
zh_cn: 电子已连接

# ElectronBotRemoveTip
source: Electron removed
ko_kr: ElectronBot이 제거되었습니다.
zh_cn: 电子已移除

# ExportToastText
source: Action exported successfully
ko_kr: 작업을 성공적으로 내보냈습니다.
zh_cn: 动作导出成功

# PlayEmptyToastText
source: Please add or import action
ko_kr: 작업을 추가하거나 가져오십시오.
zh_cn: 请添加或者导入动作

# PlayErrorToastText
source: Please switch to control mode
ko_kr: 제어 모드로 전환하십시오
zh_cn: 请切换到控制模式

# PlayClearToastText
source: List is cleared
ko_kr: 목록이 지워졌습니다
zh_cn: 列表已清空

# PlayResetToastText
source: Action reset
ko_kr: 액션 리셋
zh_cn: 动作已重置

# ChangeClockViewCB.PlaceholderText
source: switch dial
ko_kr: 스위치 다이얼
zh_cn: 切换表盘

# ClearBtn.Content
source: Clear list
ko_kr: 목록 지우기
zh_cn: 清除列表

# ControlMode.Content
source: Control mode
ko_kr: 제어 모드
zh_cn: 控制模式

# DefautView
source: Default effect
ko_kr: 기본 효과
zh_cn: 默认效果

# DisableModeRb.Content
source: Disable mode
ko_kr: 비활성화 모드
zh_cn: 禁用模式

# EntitySchemaRb.Content
source: Recording mode
ko_kr: 녹음 모드
zh_cn: 录制模式

# ExportBtn.Content
source: Export action
ko_kr: 수출 조치
zh_cn: 导出动作

# ImportBtn.Content
source: Import action
ko_kr: 가져오기 작업
zh_cn: 导入动作

# LongShadowView
source: Long shadow
ko_kr: 긴 그림자
zh_cn: 长阴影

# ModeRadioBtn.Header
source: Select mode
ko_kr: 선택 모드
zh_cn: 选择模式

# PlayBtn.Content
source: Play action
ko_kr: 행동을 하다
zh_cn: 播放动作

# PleaseConnectToastText
source: Please connect the electronics (please check the drive for the first use)
ko_kr: ElectronBot을 연결해주세요(최초 사용시 드라이버 확인 부탁드립니다)
zh_cn: 请连接电子（初次使用请检测驱动）

# ResetBtn.Content
source: Reset action
ko_kr: 리셋 동작
zh_cn: 重置动作

# Sd_Bottom.Header
source: Chassis rotation (J6)
ko_kr: 섀시 회전(J6)
zh_cn: 底盘转动ID12(J6)

# Sd_Head.Header
source: Head (J1)
ko_kr: 헤드(J1)
zh_cn: 头部ID2(J1)

# Sd_LeftArm.Header
source: Left arm rotation (J3)
ko_kr: 왼쪽 팔 회전(J3)
zh_cn: 左臂旋转ID6(J3)

# Sd_LeftArmExpansion.Header
source: Left Arm Extended (J2)
ko_kr: 왼팔 펴기(J2)
zh_cn: 左臂展开ID4(J2)

# Sd_RightArm.Header
source: Right arm rotation (J5)
ko_kr: 오른쪽 팔 회전(J5)
zh_cn: 右臂旋转ID10(J5)

# Sd_RightArmExpansion.Header
source: Right Arm Extended (J4)
ko_kr: 오른쪽 팔 확장(J4)
zh_cn: 右臂展开ID8(J4)

# StopBtn.Content
source: Stop motion
ko_kr: 스톱모션
zh_cn: 停止动作

# AddPic.Text
source: Add picture
ko_kr: 사진 추가
zh_cn: 添加图片

# ImageCropperAcceptBtn.Label
source: Confirm
ko_kr: 확인하다
zh_cn: 确认

# ImageCropperCancelBtn.Label
source: Cancel
ko_kr: 취소
zh_cn: 取消

# EmotionAnger
source: Anger
ko_kr: 화
zh_cn: 愤怒

# EmotionContempt
source: Contempt
ko_kr: 경멸
zh_cn: 蔑视

# EmotionDisgust
source: Disgust
ko_kr: 싫음
zh_cn: 厌恶

# EmotionFear
source: Fear
ko_kr: 두려움
zh_cn: 恐惧

# EmotionHappiness
source: Hapiness
ko_kr: 행복
zh_cn: 快乐

# EmotionNeutral
source: Neutral
ko_kr: 중립적
zh_cn: 中性

# EmotionSadness
source: Sad
ko_kr: 슬퍼
zh_cn: 悲伤

# EmotionSurprise
source: Surprise
ko_kr: 놀라다
zh_cn: 惊讶

# Shell_CameraEmojis.Content
source: Facial expression recognition
ko_kr: 표정 인식
zh_cn: 表情识别

# RemoveAction.Text
source: Remove action
ko_kr: 액션 제거
zh_cn: 移除动作

# CameraErrorText
source: Failed to open camera
ko_kr: 카메라를 열지 못했습니다.
zh_cn: 摄像头打开失败

# DialogAuthenticationTitle
source: Log in
ko_kr: 로그인
zh_cn: 登录

# GooeyFooter
source: Fusion effect
ko_kr: 융합 효과
zh_cn: 融合效果

# Shell_LogIn.Text
source: Log in
ko_kr: 로그인
zh_cn: 登录

# Shell_Todo.Content
source: Microsoft to do
ko_kr: 할 마이크로소프트
zh_cn: 微软待办

# CameraLoadedFailed
source: No camera found yet
ko_kr: 아직 카메라를 찾지 못했습니다.
zh_cn: 暂未发现摄像头

# Settings_Thank.Text
source: Thanks list
ko_kr: 감사 목록
zh_cn: 感谢列表

# Shell_EmojisEdit.Content
source: Facial expressions
ko_kr: 얼굴 표정
zh_cn: 表情动作

# AddEmojisCancelBtnContent
source: Cancel
ko_kr: 취소
zh_cn: 取消

# AddEmojisOkBtnContent
source: Save
ko_kr: 구하다
zh_cn: 保存

# AddEmojisTitle
source: Add emoji
ko_kr: 이모티콘 추가
zh_cn: 添加表情

# AngerName
source: Anger
ko_kr: 화
zh_cn: 愤怒

# DisdainName
source: Disdain
ko_kr: 경멸감
zh_cn: 不屑

# EmojisAvatar.Text
source: The map's address:
ko_kr: 지도 주소:
zh_cn: 图片地址：

# EmojisDesc.Text
source: describe:
ko_kr: 설명하다:
zh_cn: 描述：

# EmojisNameId.Text
source: ID:
ko_kr: 신분증:
zh_cn: 标识ID：

# EmojisNameTitle.Text
source: Name:
ko_kr: 이름:
zh_cn: 名称：

# EmojisVideoUrl.Text
source: Video address:
ko_kr: 비디오 주소:
zh_cn: 视频地址：

# ExcitedName
source: Excited
ko_kr: 흥분한
zh_cn: 兴奋

# FearName
source: Frightened
ko_kr: 겁먹은
zh_cn: 惊恐

# PlayEmojis.Text
source: Play emoji
ko_kr: 이모티콘 재생
zh_cn: 播放表情

# SadName
source: Sad
ko_kr: 슬퍼
zh_cn: 难过

# Shell_Gamepad.Content
source: Controller
ko_kr: 제어 장치
zh_cn: 手柄控制器

# Add.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Add action frame
ko_kr: 동작 프레임 추가
zh_cn: 添加动作帧

# AddEmojisBtn.Label
source: Add new emoji
ko_kr: 새로운 이모티콘 추가
zh_cn: 添加新表情

# AppLogoAuthor.Content
source: Application LOGO author (oooooohmygosh) station B address
ko_kr: 응용 프로그램 로고 작성자(ooooooohmygosh) 스테이션 B 주소
zh_cn: 应用LOGO作者(oooooohmygosh)B站地址

# AppTheme.Text
source: Apply theme
ko_kr: 테마 적용
zh_cn: 应用主题

# AudioCB.Header
source: Default audio device
ko_kr: 기본 오디오 장치
zh_cn: 默认音频设备

# AudioCB.PlaceholderText
source: Default audio device
ko_kr: 기본 오디오 장치
zh_cn: 默认音频设备

# CameraCB.Header
source: Default camera
ko_kr: 기본 카메라
zh_cn: 默认相机

# CameraCB.PlaceholderText
source: Default camera
ko_kr: 기본 카메라
zh_cn: 默认相机

# ClockAuthor.Content
source: Dial project reference author (DinoChan) Github address
ko_kr: Dial 프로젝트 참조 작성자(DinoChan) Github 주소
zh_cn: 表盘项目参考作者(DinoChan)Github地址

# ClockConfig.Text
source: Dial configuration
ko_kr: 다이얼 구성
zh_cn: 表盘配置

# ClockCumstomWords.Text
source: Dial custom text:
ko_kr: 사용자 지정 문자로 전화 걸기:
zh_cn: 表盘自定义文字：

# ClockCustomFontSize.Text
source: Dial custom text font size:
ko_kr: 다이얼 사용자 지정 텍스트 글꼴 크기:
zh_cn: 表盘自定义文字字体大小：

# ClockParameter.Text
source: Set dial parameters
ko_kr: 다이얼 매개변수 설정
zh_cn: 设置表盘参数

# DefaultDeviceConfig.Text
source: Default device settings
ko_kr: 기본 장치 설정
zh_cn: 默认设备设置

# ElectronBotInfo.Content
source: Introduction address of ElectronBot Braincase
ko_kr: ElectronBot Braincase 소개 주소
zh_cn: 电子脑壳介绍地址

# EmojisInfoTitle
source: Emoticon details
ko_kr: 이모티콘 세부정보
zh_cn: 表情详情

# Export.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Export action
ko_kr: 수출 조치
zh_cn: 导出动作

# GamepadViewCB.PlaceholderText
source: Select handle
ko_kr: 핸들 선택
zh_cn: 选择手柄

# Import.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Import action
ko_kr: 가져오기 작업
zh_cn: 导入动作

# Reference.Text
source: Referenced projects and links to some resources
ko_kr: 참조된 프로젝트 및 일부 리소스에 대한 링크
zh_cn: 参考的项目和一些资源的链接

# SelectAppTheme.Text
source: Select App Themes to Display
ko_kr: 표시할 앱 테마 선택
zh_cn: 选择要显示的应用主题

# SettingDefaultDevice.Text
source: Set related default devices
ko_kr: 관련 기본 장치 설정
zh_cn: 设置相关默认设备

# TestEmoji.Content
source: Test expression
ko_kr: 테스트 표현식
zh_cn: 测试表情

# TestVoice.Content
source: Test voice
ko_kr: 테스트 음성
zh_cn: 测试语音

# ViewEmojisInfo.Text
source: Check the details
ko_kr: 세부 사항을 확인
zh_cn: 查看详情

# ClockModeRb.Content
source: Clock mode
ko_kr: 시계 모드
zh_cn: 时钟模式

# EmojisEmpty
source: Emoticons cannot be empty
ko_kr: 이모티콘은 비워둘 수 없습니다.
zh_cn: 表情表示不能为空

# EmojisListEmpty
source: Action list cannot be empty
ko_kr: 작업 목록은 비워둘 수 없습니다.
zh_cn: 动作列表不能为空

# EmojisActionAddTB.Text
source: Import action buttons:
ko_kr: 작업 버튼 가져오기:
zh_cn: 导入动作按钮：

# EmojisActionFileSize
source: The file should be less than 5 megabytes
ko_kr: 파일은 5MB 미만이어야 합니다.
zh_cn: 文件请小于5兆

# EmojisActionPath.Text
source: Action address:
ko_kr: 조치 주소:
zh_cn: 动作地址：

# EmojisAvatarBtn.Text
source: Add image button:
ko_kr: 이미지 추가 버튼:
zh_cn: 添加图片按钮：

# EmojisFileSize
source: The file should be less than 1 MB
ko_kr: 파일은 1MB 미만이어야 합니다.
zh_cn: 文件请小于1兆

# EmojisNameIdAlreadyExists
source: This emoticon ID already exists
ko_kr: 이 이모티콘 ID는 이미 존재합니다.
zh_cn: 此表情Id已存在

# EmojisNameIdOnlyEn
source: Emoticons only support English letters and numbers
ko_kr: 이모티콘은 영문과 숫자만 지원합니다.
zh_cn: 表情标识只支持英文字母和数字

# EmojisVideoAddTB.Text
source: Add video button:
ko_kr: 동영상 추가 버튼:
zh_cn: 添加视频按钮：

# SetEmojisName
source: Please set emoticon name
ko_kr: 이모티콘 이름을 설정해주세요
zh_cn: 请设置表情名称

# ReconnectBtn.Content
source: Reconnect ElectronBot
ko_kr: ElectronBot 다시 연결
zh_cn: 重连电子

# ReconnectText
source: Reconnect ElectronBot
ko_kr: ElectronBot 다시 연결
zh_cn: 重连电子

# RebootElectron.Content
source: Reset ElectronBot
ko_kr: ElectronBot 재설정
zh_cn: 复位电子

# Shell_GestureClassification.Content
source: Gesture Recognition
ko_kr: 제스처 인식
zh_cn: 手势识别

# GradientsWithBlend
source: Resource monitoring
ko_kr: 리소스 모니터링
zh_cn: 资源监控

# RadialGaugeCPU.Unit
source: Percentage
ko_kr: 백분율
zh_cn: 百分比

# RadialGaugeROM.Unit
source: Percentage
ko_kr: 백분율
zh_cn: 百分比

# AddRandomContentBtn.Label
source: Add random content
ko_kr: 무작위 콘텐츠 추가
zh_cn: 添加随机内容

# AddRandomContentTitle
source: Add random content
ko_kr: 무작위 콘텐츠 추가
zh_cn: 添加随机内容

source: Content already exists
ko_kr: 콘텐츠가 이미 존재합니다.
zh_cn: 内容已存在

# DelEmojis.Text
source: Delete emoticon
ko_kr: 이모티콘 삭제
zh_cn: 删除表情

# DelRandomContent.Text
source: Delete
ko_kr: 삭제
zh_cn: 删除

# Settings_AboutUpdate.Text
source: 1.6.3 Version Update Instructions 1. Add gesture recognition and synchronize gesture actions to the model. 1.6.2 Version Update Instructions 1. Add a gesture interaction page and update some emoticon files. 1.6.1 Version Update Instructions 1. Optimize the facial expression recognition page, add model synchronization robot entity action. 2. Add Korean interface resource files. 1.6.0 Version Update Instructions 1. Add electronic simulation to independently demonstrate the choreographed action. 1.5.4 Version Update Instructions 1. To add a custom watch face function, you can set your own watch face by configuring text in the settings interface. 1.5.3 Version Update Instructions 1. Fix the Microsoft account login can not persist to save the login status. 2. Add ElectronBot Braincase to increase English translation. 1.5.2 Version update instructions 1. Adjust the source code directory naming. 2. Add the pin-pointing mode, that is, control the electronics through the mouse pointer, and press the scroll wheel to trigger the random expression playback function, provided that it is in the pin-pointing mode. 1.5.1 Version update instructions 1. Refactor the code and upgrade the framework to .net7 and windows app sdk 1.3. 2. Optimize the electronic connection, you can open the electronic head, and then insert the electronic, hot-swapping is also repaired, laying a stable foundation for later functions. 1.5.0 version update instructions 1. Add online emoticon sharing function, similar to the emoticon mall function, you can share and download emoticon files. 2. Adjust the UI display and optimize the light and dark theme colors of the pop-up window. 1.4.4 Version Update Instructions 1. Add the registration of the electronic brain case that starts automatically after booting, and select the emoticon that will play the emoticon list three times randomly. If you don't like to boot automatically, please go to System Settings => Application => Start to disable. 1.4.3 Version Update Instructions 1. Adjust the ChatGPT docking to ApiKey docking, which is more user-friendly. 2. Open the handle control page, currently supports Xbox handle control electronics. 1.4.2 Version update instructions 1. Add the import and export function of emoticons 2. Add an email feedback link, you can directly click to make function suggestions and BUG feedback. 1.4.1 Version update instructions 1. Adjust the theme color of the electronic brain case to return to the color before reconstruction. 2. Add ChatGPT and Turing robot configuration, Turing robot please apply on the Turing robot official website and then put the AppKey into the electronic brain case configuration. 3. Optimize the UI style. 1.4 Version Update Instructions 1. Gesture recognition is added to the homepage, including opening Bilibili for testing, and playing emoticons randomly. Currently, voice recognition is triggered by heart-to-heart triggering. 2. Select the gesture trigger of the difficult page as the action of clenching a fist and touching the fist as the trigger, and ok as the stop. 3. Added the deletion of emoticons on the emoticon creation page, fixed the problem of color difference in video playback, and the problem that the video cannot play sound.
ko_kr: 1.6.3 버전 업데이트 지침 1. 제스처 인식을 추가하고 제스처 동작을 모델에 동기화합니다. 1.6.2 버전 업데이트 지침 1. 제스처 상호 작용 페이지를 추가하고 일부 이모티콘 파일을 업데이트합니다. 1.6.1 버전 업데이트 지침 1. 얼굴 표정 인식 페이지 최적화, 모델 동기화 로봇 엔터티 작업 추가. 2. 한국어 인터페이스 리소스 파일을 추가합니다. 1.6.0 버전 업데이트 안내 1. 안무 동작을 독립적으로 시연할 수 있는 전자 시뮬레이션을 추가합니다. 1.5.4 버전 업데이트 지침 1. 사용자 정의 시계 모드 기능을 추가하면 설정 인터페이스에서 텍스트를 구성하여 나만의 시계 모드를 설정할 수 있습니다. 1.5.3 버전 업데이트 지침 1. 로그인 상태를 저장하기 위해 Microsoft 계정 로그인이 지속되지 않는 문제를 수정했습니다. 2. 전자 두뇌 케이스를 추가하여 영어 번역을 높입니다. 1.5.2 버전 업데이트 지침 1. 소스 코드 디렉토리 이름을 조정합니다. 2. 핀 포인팅 모드를 추가합니다. 즉, 마우스 포인터를 통해 전자 장치를 제어하고 핀 포인팅 모드에 있는 경우 스크롤 휠을 눌러 임의 표현 재생 기능을 트리거합니다. 1.5.1 버전 업데이트 지침 1. 코드를 리팩터링하고 프레임워크를 .net7 및 Windows 앱 SDK 1.3으로 업그레이드합니다. 2. 전자 연결을 최적화하면 전자 헤드를 연 다음 전자를 삽입할 수 있으며 핫 스왑도 수리되어 이후 기능을 위한 안정적인 기반을 마련합니다. 1.5.0 버전 업데이트 안내 1. 온라인 이모티콘 공유 기능 추가, 이모티콘 몰 기능과 유사하게 이모티콘 파일을 공유 및 다운로드 할 수 있습니다. 2. UI 디스플레이를 조정하고 팝업 창의 밝고 어두운 테마 색상을 최적화합니다. 1.4.4 버전 업데이트 지침 1. 부팅 후 자동으로 시작되는 전자두뇌 케이스 등록을 추가하고, 이모티콘 목록을 무작위로 3번 재생시킬 이모티콘을 선택합니다. 자동 부팅을 원하지 않으시면 시스템 설정 => 응용 프로그램 => 시작으로 이동하여 비활성화하십시오. 1.4.3 버전 업데이트 지침 1. ChatGPT 도킹을 보다 사용자 친화적인 ApiKey 도킹으로 조정합니다. 2. 현재 Xbox 핸들 컨트롤 전자 장치를 지원하는 핸들 컨트롤 페이지를 엽니다. 1.4.2 버전 업데이트 지침 1. 이모티콘 가져오기 및 내보내기 기능 추가 2. 이메일 피드백 링크를 추가하면 직접 클릭하여 기능 제안 및 버그 피드백을 할 수 있습니다. 1.4.1 버전 업데이트 안내 1. 재구성 전 색상으로 돌아가려면 전자 두뇌 케이스의 테마 색상을 조정하십시오. 2. ChatGPT 및 Turing 로봇 구성을 추가하십시오. Turing 로봇은 Turing 로봇 공식 웹 사이트에서 신청한 다음 AppKey를 전자 두뇌 케이스 구성에 넣으십시오. 3. UI 스타일을 최적화합니다. 1.4 버전 업데이트 안내 1. 테스트를 위해 Bilibili를 열고 이모티콘을 무작위로 재생하는 등 제스처 인식이 홈페이지에 추가되었습니다.현재 음성 인식은 하트 투 하트 트리거로 트리거됩니다. 2. 어려운 페이지의 제스처 트리거를 주먹을 쥐고 주먹을 대는 동작을 트리거로 선택하고 ok를 중지로 선택합니다. 3. 이모티콘 생성 페이지에서 이모티콘 삭제 기능 추가, 영상 재생 시 색상 차이 문제, 영상에서 음성 재생이 안되는 문제를 수정하였습니다.
zh_cn: 1.7.8 版本更新说明（2024-09-04） 1. 重构瀚文键盘刷图逻辑，逻辑单独运行。 2. 修复图片剪切bug。 1.7.7 版本更新说明（2024-07-11） 1. 修复精英版winusb免驱固件电子脑壳闪退问题。 2. 修复1.7.6发版导致瀚文键盘天气故障bug。 1.7.6 版本更新说明（2024-06-30） 1. 针对精英版winusb免驱固件的兼容。 1.7.5 版本更新说明（2024-05-21） 1. 瀚文键盘旋钮对接智能家居，需要配置Home Assistant的连接密钥使用。 2. 修复瀚文键盘页面定时BUG。 3. 重构电子脑壳设置页面。 4. 对接讯飞星火大语言模型。 5. 电子配置项增加锁屏和解锁互动。 6. 修复若干BUG引入新的BUG。 1.7.2 版本更新说明 1. 添加语音主动触发按钮，以及添加openai代理域名配置。 1.7.1 版本更新说明 1. 优化提示信息和界面显示。 1.7.0 版本更新说明 1. 升级.Net版本为8.0. 2. 添加瀚文键盘模式。 1.6.8 版本更新说明 1. 升级框架版本为1.4，并升级社区工具到8.0。 2. 可能会引入相关新的BUG。 3. 添加语音唤醒应用功能，在语音配置页配置应用，在电子仿真窗口按下空格加E组合按键，通过语音打开+应用名称，或者启用+应用名称唤醒软件。 1.6.3 版本更新说明 1. 添加姿态识别，并同步姿态动作到模型。 1.6.2 版本更新说明 1. 添加手势互动页面，更新部分表情动作文件。 1.6.1 版本更新说明 1. 优化表情识别页面，添加模型同步机器人实体动作。 2. 增加韩语界面资源文件。 1.6.0 版本更新说明 1. 添加电子仿真，可以独立演示编排的动作。 1.5.4 版本更新说明 1. 添加自定义表盘功能，可以通过在设置界面配置文本设置自己的表盘。 1.5.3 版本更新说明 1. 修复微软账号登录不能持久化保存登录状态。 2. 添加电子脑壳增加英文翻译。 1.5.2 版本更新说明 1. 调整源码目录命名。 2. 添加盯针模式，也就是通过鼠标指针控制电子，并通过滚轮按下触发随机表情播放功能，前提是在盯针模式下。 1.5.1 版本更新说明 1. 重构代码升级框架到.net7和windows app sdk 1.3。 2. 优化电子连接，可以打开电子脑壳，然后插入电子，热拔插也进行修复，为后期功能打下稳定的基础。 1.5.0 版本更新说明 1. 添加在线表情分享功能，类似于表情商城的功能，可以分享下载表情文件。 2. 调整UI显示，优化弹窗的明暗主题色。 1.4.4 版本更新说明 1. 添加开机自启动电子脑壳注册，并选择随机播放三次表情列表的表情。如果不喜欢开机自启，请到系统设置=>应用=>启动 禁用。 1.4.3 版本更新说明 1. 调整ChatGPT对接改成ApiKey对接，更加人性化。 2. 开放手柄控制页面，目前支持Xbox手柄控制电子。 1.4.2 版本更新说明 1. 添加表情的导入导出功能 2. 添加邮件反馈链接，可以直接点击进行功能建议和BUG反馈。 1.4.1 版本更新说明 1. 调整电子脑壳主题色，恢复到重构之前的颜色。 2. 加入ChatGPT和图灵机器人配置，图灵机器人请在图灵机器人官网申请然后将AppKey放入到电子脑壳配置里。 3. 优化UI样式。 1.4版本更新说明 1. 首页加入手势识别，包含打开B站测试，和撒个娇随机播放表情，目前采用比心触发语音识别，ok结束，再次比心触发。 2. 选择困难页的手势触发为握紧拳头碰拳头的动作为触发，ok为停止。 3. 表情创建页面添加了表情的删除，修复视频播放色差问题，以及视频不能播放声音问题。

# Settings_Update.Text
source: Release Notes
ko_kr: 릴리즈 노트
zh_cn: 更新说明

# AnswerText.Text
source: Gesture Recognition Voice Response Text:
ko_kr: 제스처 인식 음성 응답 텍스트:
zh_cn: 手势识别语音回复文本：

# ChatBotSecurityData.Text
source: Speech dialog provider configuration
ko_kr: 음성 대화 공급자 구성
zh_cn: 语音对话提供程序配置

# ChatBotSecurityDataDesc.Text
source: Provides key configuration and program switching
ko_kr: 키 구성 및 프로그램 전환 제공
zh_cn: 提供密钥配置和程序切换

# ChatBotType.Text
source: Default speech provider:
ko_kr: 기본 음성 공급자:
zh_cn: 默认语音提供程序：

# Turing-AppKey.Text
source: Turing Robot AppKey:
ko_kr: 튜링 로봇 앱키:
zh_cn: 图灵机器人AppKey：

# Turing-UserId.Text
source: Turing Robot UserId:
ko_kr: 튜링 로봇 사용자 ID:
zh_cn: 图灵机器人UserId：

# TuringTitle
source: Turing robot
ko_kr: 튜링 로봇
zh_cn: 图灵机器人

# CameraPreviewImage.Text
source: Camera Screen Preview
ko_kr: 카메라 화면 미리보기
zh_cn: 相机画面预览

# ActionEditTitle.Text
source: Action Timeline
ko_kr: ElectronBot 작업 타임라인
zh_cn: 电子动作时间轴

# ExportEmojis.Text
source: Export emoticon file
ko_kr: 이모티콘 내보내기
zh_cn: 导出表情

# ImportEmojisFileBtn.Label
source: Import emoticons
ko_kr: 이모티콘 가져오기
zh_cn: 导入表情

# ElectronBotCode.Content
source: Source code address of ElectronBot Braincase
ko_kr: ElectronBot Braincase 소스 주소
zh_cn: 电子脑壳源码地址

# MarketplaceBtn.Label
source: Emoji Mall
ko_kr: 이모티콘 몰
zh_cn: 表情商城

# UploadEmojis.Text
source: Share emoticons
ko_kr: 이모티콘 공유
zh_cn: 分享表情

# DownLoadEmojis.Text
source: Download emoticons
ko_kr: 이모티콘 다운로드
zh_cn: 下载表情

# MarketplaceDialogClose
source: Closure
ko_kr: 폐쇄
zh_cn: 关闭

# MarketplaceDialogTitle
source: Emoji Mall
ko_kr: 이모티콘 몰
zh_cn: 表情商城

# UploadEmojisAuthorTitle.Text
source: Author:
ko_kr: 작가:
zh_cn: 作者：

# UploadEmojisCreateTimeTitle.Text
source: Creation time:
ko_kr: 생성 시간:
zh_cn: 创建时间：

# UploadEmojisDescTitle.Text
source: Describe:
ko_kr: 설명하다:
zh_cn: 描述：

# UploadEmojisNameIdTitle.Text
source: ID：
ko_kr: 신분증:
zh_cn: 标识ID：

# UploadEmojisNameTitle.Text
source: Name:
ko_kr: 이름:
zh_cn: 名称：

# UploadEmojisOKBtn
source: Share
ko_kr: 공유하다
zh_cn: 分享

# UploadEmojisTitle
source: Emoticon sharing
ko_kr: 이모티콘 공유
zh_cn: 表情分享

# DownloadDebugger.Content
source: Click the text to download the electronic commissioning assistant
ko_kr: 전자 커미셔닝 도우미를 다운로드하려면 텍스트를 클릭하십시오.
zh_cn: 点击文字下载电子调试助手

# FeedBackText.Text
source: Give me feedback
ko_kr: 나에게 피드백을 줘
zh_cn: 反馈点我

# hlOpenPrivacySettings.Text
source: If the speech recognition is abnormal, please confirm whether the speech recognition policy is enabled, and the policy is enabled to allow personalization.
ko_kr: 음성 인식이 비정상적인 경우 음성 인식 정책이 활성화되어 있는지, 개인화를 허용하도록 정책이 활성화되어 있는지 확인하십시오.
zh_cn: 如果语音识别异常请确认是否打开语音识别策略，开启策略允许个性化。

# OpenGestureSwitch.OffContent
source: Turn on gesture
ko_kr: 제스처 인식 켜기
zh_cn: 打开手势识别

# OpenGestureSwitch.OnContent
source: Turn off gesture
ko_kr: 제스처 인식 끄기
zh_cn: 关闭手势识别

# PrivacyHyperLink.Content
source: Click on the text to enter the policy setting page
ko_kr: 텍스트를 클릭하여 정책 설정 페이지로 들어갑니다.
zh_cn: 点击文字进入策略设置页

# NeedleModeRb.Content
source: Pin mode
ko_kr: 핀 모드
zh_cn: 盯针模式

# ExitBtn_CloseButtonText
source: Cancel
ko_kr: 취소
zh_cn: 取消

# ExitBtn_PrimaryButtonText
source: Sure
ko_kr: 확신하는
zh_cn: 确定

# ExitBtn_SecondaryButtonText
source: Palletization
ko_kr: 팔레타이징
zh_cn: 托盘化

# ExitBtn_Title
source: Do you want to close the application?
ko_kr: 응용 프로그램을 닫으시겠습니까?
zh_cn: 是否关闭应用?

# Settings_LogIn.Content
source: Log in
ko_kr: 로그인
zh_cn: 登录

# Settings_LogOut.Content
source: Log out
ko_kr: 로그아웃
zh_cn: 登出

# Settings_NoUserLoggedIn.Text
source: There is no user logged in, please click "Log In" to log in.
ko_kr: 로그인한 사용자가 없습니다. "로그인"을 클릭하여 로그인하십시오.
zh_cn: 没有用户登录，请点击“登录”登录。

# AppQuit_Content.Text
source: This option is to prevent accidental closing of the application
ko_kr: 이 옵션은 응용 프로그램이 실수로 닫히는 것을 방지하기 위한 것입니다.
zh_cn: 此选项是防止意外关闭应用

# ElectronSourceCode.Content
source: The open source address of the ElectronBot robot
ko_kr: ElectronBot 로봇의 오픈 소스 주소
zh_cn: ElectronBot机器人的开源地址

source: CustomView
ko_kr: 맞춤화하다
zh_cn: 自定义

# CustomClockViewConfig.Text
source: Custom Dial configuration
ko_kr: 맞춤 시계 모드 구성
zh_cn: 自定义表盘配置

# CustomViewContentIsVisibility.Text
source: Content is visible:
ko_kr: 텍스트 표시 여부:
zh_cn: 是否显示文本：

# CustomViewGaussianBlurValue.Text
source: GaussianBlur Value:
ko_kr: 가우시안 블러 값:
zh_cn: 高斯模糊值：

# ElectronEmulation.Content
source: Emulation
ko_kr: ElectronBot 시뮬레이션
zh_cn: 电子仿真

# OpenEntityFirstSwitch.OffContent
source: Turn on the robot action first
ko_kr: 로봇 작업 우선순위 켜기
zh_cn: 打开机器人动作优先

# OpenEntityFirstSwitch.OnContent
source: Turn off the robot action first
ko_kr: 로봇 작업 우선 순위 끄기
zh_cn: 关闭机器人动作优先

# Shell_GestureInteraction.Content
source: Gesture interaction
ko_kr: 제스처 상호 작용
zh_cn: 手势互动

# LeftName
source: Left
ko_kr: 왼쪽
zh_cn: 左转

# NormalName
source: Normal
ko_kr: 정적인
zh_cn: 静态

# RightName
source: Right
ko_kr: 우회전
zh_cn: 右转

# Shell_PoseRecognition.Content
source: Pose recognition
ko_kr: 포즈 인식
zh_cn: 姿态识别

# Shell_Movie.Content
source: Viewing Mode
ko_kr: 보기 모드
zh_cn: 观影模式

# Shell_GestureAppConfig.Content
source: Gesture App Config
zh_cn: 语音启动应用

# GestureAppConfigTree_AppPath.Text
source: App Path
zh_cn: APP路径

# GestureAppConfigTree_DeleteButton.Content
source: Delete
zh_cn: 删除

# GestureAppConfigTree_GestureLabel.Text
source: Start Gesture
zh_cn: 启动手势

# GestureAppConfigTree_Text.Text
source: Speech Text
zh_cn: 语音文本

# GestureAppConfig_Add.Content
source: Add
zh_cn: 添加

# GestureAppConfig_Save.Content
source: Save
zh_cn: 保存

# ChatGPTVersion.Text
source: ChatGPT-Model:
zh_cn: ChatGPT模型Id：

# BotSettingTitle.Text
source: BotSetting
zh_cn: 电子相关配置项

# NotificationAreaIconExitText
source: Exit
zh_cn: 退出

# NotificationAreaIconMenuItemText
source: DisplayOrHide
zh_cn: 显示或者隐藏
